Revit 2027 API
LoadCase.IsLoadNatureId Method
 Checks whether provided element ID refer to LoadNature element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsLoadNatureId(
	ElementId natureId
)
Public Function IsLoadNatureId (
	natureId As ElementId
) As Boolean
public:
bool IsLoadNatureId(
	ElementId^ natureId
)
member IsLoadNatureId :
        natureId : ElementId -> bool
Parameters
natureId ElementId
 The ID to check.
Return Value
Boolean
 True if the ID refers to LoadNature element, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LoadCase Class
Autodesk.Revit.DB.Structure Namespace